zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3u1xx/SI32_SIM3U1XX_LOCK_A_Registers.h
//------------------------------------------------------------------------------
// Copyright 2012 (c) Silicon Laboratories Inc.
//
// SPDX-License-Identifier: Zlib
//
// This siHAL software is provided 'as-is', without any express or implied
// warranty. In no event will the authors be held liable for any damages
// arising from the use of this software.
//
// Permission is granted to anyone to use this software for any purpose,
// including commercial applications, and to alter it and redistribute it
// freely, subject to the following restrictions:
//
// 1. The origin of this software must not be misrepresented; you must not
//    claim that you wrote the original software. If you use this software
//    in a product, an acknowledgment in the product documentation would be
//    appreciated but is not required.
// 2. Altered source versions must be plainly marked as such, and must not be
//    misrepresented as being the original software.
// 3. This notice may not be removed or altered from any source distribution.
//------------------------------------------------------------------------------
//
// This file applies to the SIM3U1XX_LOCK_A module
//
// Script: 0.57
// Version: 1

#ifndef __SI32_LOCK_A_REGISTERS_H__
#define __SI32_LOCK_A_REGISTERS_H__

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

struct SI32_LOCK_A_KEY_Struct
{
   union
   {
      struct
      {
         // Peripheral Lock Mask Key
         volatile uint8_t KEY_BITS;
                  uint32_t reserved0: 24;
      };
      volatile uint32_t U32;
   };
};

#define SI32_LOCK_A_KEY_KEY_MASK  0x000000FF
#define SI32_LOCK_A_KEY_KEY_SHIFT  0
// PERIPHLOCK registers are locked and no valid values have been written to KEY.
#define SI32_LOCK_A_KEY_KEY_LOCKED_VALUE  0
#define SI32_LOCK_A_KEY_KEY_LOCKED_U32 \
   (SI32_LOCK_A_KEY_KEY_LOCKED_VALUE << SI32_LOCK_A_KEY_KEY_SHIFT)
// PERIPHLOCK registers are locked and the first valid value (0xA5) has been
// written to KEY.
#define SI32_LOCK_A_KEY_KEY_INTERMEDIATE_VALUE  1
#define SI32_LOCK_A_KEY_KEY_INTERMEDIATE_U32 \
   (SI32_LOCK_A_KEY_KEY_INTERMEDIATE_VALUE << SI32_LOCK_A_KEY_KEY_SHIFT)
// PERIPHLOCK registers are unlocked. Any subsequent writes to KEY will lock the
// interface.
#define SI32_LOCK_A_KEY_KEY_UNLOCKED_VALUE  2
#define SI32_LOCK_A_KEY_KEY_UNLOCKED_U32 \
   (SI32_LOCK_A_KEY_KEY_UNLOCKED_VALUE << SI32_LOCK_A_KEY_KEY_SHIFT)



struct SI32_LOCK_A_PERIPHLOCK0_Struct
{
   union
   {
      struct
      {
         // USART/UART Module Lock Enable
         volatile uint32_t USARTL: 1;
         // SPI Module Lock Enable
         volatile uint32_t SPIL: 1;
         // I2C Module Lock Enable
         volatile uint32_t I2CL: 1;
         // PCA Module Lock Enable
         volatile uint32_t PCAL: 1;
         // Timer Module Lock Enable
         volatile uint32_t TIMERL: 1;
         // USB Module Lock Enable
         volatile uint32_t USBL: 1;
         // SARADC Module Lock Enable
         volatile uint32_t SARADCL: 1;
         // SSG Module Lock Enable
         volatile uint32_t SSGL: 1;
         // Comparator Module Lock Enable
         volatile uint32_t CMPL: 1;
         // Capacitive Sensing Module Lock Enable
         volatile uint32_t CSL: 1;
         // EMIF Module Lock Enable
         volatile uint32_t EMIFL: 1;
         // AES Module Lock Enable
         volatile uint32_t AESL: 1;
         // CRC Module Lock Enable
         volatile uint32_t CRCL: 1;
         // RTC Module Lock Enable
         volatile uint32_t RTCL: 1;
         // Clock Control and Reset Sources Lock Enable
         volatile uint32_t CLKRSTL: 1;
         // Voltage Supply Monitor Module Lock Enable
         volatile uint32_t VMONL: 1;
         // IDAC Module Lock Enable
         volatile uint32_t IDACL: 1;
         // DMA Controller Module Lock Enable
         volatile uint32_t DMACTRLL: 1;
         // DMA Crossbar Module Lock Enable
         volatile uint32_t DMAXBARL: 1;
         // Low Power Timer Module Lock Enable
         volatile uint32_t LPTL: 1;
         // Voltage Reference Module Lock Enable
         volatile uint32_t VREFL: 1;
         // I2S Module Lock Enable
         volatile uint32_t I2SL: 1;
         // PLL Module Lock Enable
         volatile uint32_t PLLL: 1;
         // External Oscillator Module Lock Enable
         volatile uint32_t EXTOSCL: 1;
         // Voltage Regulator Module Lock Enable
         volatile uint32_t VREGL: 1;
         // Low Power Oscillator Lock Enable
         volatile uint32_t LPOSCL: 1;
         // External Regulator Module Lock Enable
         volatile uint32_t EVREGL: 1;
                  uint32_t reserved0: 1;
         // IVC Module Lock Enable
         volatile uint32_t IVCL: 1;
                  uint32_t reserved1: 3;
      };
      volatile uint32_t U32;
   };
};

#define SI32_LOCK_A_PERIPHLOCK0_USARTL_MASK  0x00000001
#define SI32_LOCK_A_PERIPHLOCK0_USARTL_SHIFT  0
// Unlock the USART0, USART1, UART0, and UART1 Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_USARTL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_USARTL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_USARTL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_USARTL_SHIFT)
// Lock the USART0, USART1, UART0, and UART1 Module registers (bits can still be
// read).
#define SI32_LOCK_A_PERIPHLOCK0_USARTL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_USARTL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_USARTL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_USARTL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_SPIL_MASK  0x00000002
#define SI32_LOCK_A_PERIPHLOCK0_SPIL_SHIFT  1
// Unlock the SPI0, SPI1, and SPI2 Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_SPIL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_SPIL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_SPIL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_SPIL_SHIFT)
// Lock the SPI0, SPI1, and SPI2 Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_SPIL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_SPIL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_SPIL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_SPIL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_I2CL_MASK  0x00000004
#define SI32_LOCK_A_PERIPHLOCK0_I2CL_SHIFT  2
// Unlock the I2C0 and I2C1 Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_I2CL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_I2CL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_I2CL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_I2CL_SHIFT)
// Lock the I2C0 and I2C1 Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_I2CL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_I2CL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_I2CL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_I2CL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_PCAL_MASK  0x00000008
#define SI32_LOCK_A_PERIPHLOCK0_PCAL_SHIFT  3
// Unlock the EPCA0, PCA0, and PCA1 Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_PCAL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_PCAL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_PCAL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_PCAL_SHIFT)
// Lock the EPCA0, PCA0, and PCA1 Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_PCAL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_PCAL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_PCAL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_PCAL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_TIMERL_MASK  0x00000010
#define SI32_LOCK_A_PERIPHLOCK0_TIMERL_SHIFT  4
// Unlock the TIMER0 and TIMER1 Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_TIMERL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_TIMERL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_TIMERL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_TIMERL_SHIFT)
// Lock the TIMER0 and TIMER1 Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_TIMERL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_TIMERL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_TIMERL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_TIMERL_SHIFT)

