zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3u1xx/SI32_SIM3U1XX_LOCK_A_Registers.h
#define SI32_LOCK_A_PERIPHLOCK0_USBL_MASK  0x00000020
#define SI32_LOCK_A_PERIPHLOCK0_USBL_SHIFT  5
// Unlock the USB0 Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_USBL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_USBL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_USBL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_USBL_SHIFT)
// Lock the USB0 Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_USBL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_USBL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_USBL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_USBL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_SARADCL_MASK  0x00000040
#define SI32_LOCK_A_PERIPHLOCK0_SARADCL_SHIFT  6
// Unlock the SARADC0 and SARADC1 Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_SARADCL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_SARADCL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_SARADCL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_SARADCL_SHIFT)
// Lock the SARADC0 and SARADC1 Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_SARADCL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_SARADCL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_SARADCL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_SARADCL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_SSGL_MASK  0x00000080
#define SI32_LOCK_A_PERIPHLOCK0_SSGL_SHIFT  7
// Unlock the SSG0 Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_SSGL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_SSGL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_SSGL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_SSGL_SHIFT)
// Lock the SSG0 Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_SSGL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_SSGL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_SSGL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_SSGL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_CMPL_MASK  0x00000100
#define SI32_LOCK_A_PERIPHLOCK0_CMPL_SHIFT  8
// Unlock the Comparator 0 and Comparator 1 Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_CMPL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_CMPL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_CMPL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_CMPL_SHIFT)
// Lock the Comparator 0 and Comparator 1 Module registers (bits can still be
// read).
#define SI32_LOCK_A_PERIPHLOCK0_CMPL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_CMPL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_CMPL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_CMPL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_CSL_MASK  0x00000200
#define SI32_LOCK_A_PERIPHLOCK0_CSL_SHIFT  9
// Unlock the Capacitive Sensing (CAPSENSE0) Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_CSL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_CSL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_CSL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_CSL_SHIFT)
// Lock the Capacitive Sensing (CAPSENSE0) Module registers (bits can still be
// read).
#define SI32_LOCK_A_PERIPHLOCK0_CSL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_CSL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_CSL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_CSL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_EMIFL_MASK  0x00000400
#define SI32_LOCK_A_PERIPHLOCK0_EMIFL_SHIFT  10
// Unlock the External Memory Interface (EMIF0) Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_EMIFL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_EMIFL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_EMIFL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_EMIFL_SHIFT)
// Lock the External Memory Interface (EMIF0) Module registers (bits can still be
// read).
#define SI32_LOCK_A_PERIPHLOCK0_EMIFL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_EMIFL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_EMIFL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_EMIFL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_AESL_MASK  0x00000800
#define SI32_LOCK_A_PERIPHLOCK0_AESL_SHIFT  11
// Unlock the AES0 Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_AESL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_AESL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_AESL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_AESL_SHIFT)
// Lock the AES0 Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_AESL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_AESL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_AESL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_AESL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_CRCL_MASK  0x00001000
#define SI32_LOCK_A_PERIPHLOCK0_CRCL_SHIFT  12
// Unlock the CRC0 Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_CRCL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_CRCL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_CRCL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_CRCL_SHIFT)
// Lock the CRC0 Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_CRCL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_CRCL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_CRCL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_CRCL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_RTCL_MASK  0x00002000
#define SI32_LOCK_A_PERIPHLOCK0_RTCL_SHIFT  13
// Unlock the RTC0 Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_RTCL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_RTCL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_RTCL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_RTCL_SHIFT)
// Lock the RTC0 Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_RTCL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_RTCL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_RTCL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_RTCL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_CLKRSTL_MASK  0x00004000
#define SI32_LOCK_A_PERIPHLOCK0_CLKRSTL_SHIFT  14
// Unlock the Clock Control (CLKCTRL) and Reset Sources (RSTSRC) Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_CLKRSTL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_CLKRSTL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_CLKRSTL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_CLKRSTL_SHIFT)
// Lock the Clock Control (CLKCTRL) and Reset Sources (RSTSRC) Module registers
// (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_CLKRSTL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_CLKRSTL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_CLKRSTL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_CLKRSTL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_VMONL_MASK  0x00008000
#define SI32_LOCK_A_PERIPHLOCK0_VMONL_SHIFT  15
// Unlock the Voltage Supply Monitor (VMON0) Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_VMONL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_VMONL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_VMONL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_VMONL_SHIFT)
// Lock the Voltage Supply Monitor (VMON0) Module registers (bits can still be
// read).
#define SI32_LOCK_A_PERIPHLOCK0_VMONL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_VMONL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_VMONL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_VMONL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_IDACL_MASK  0x00010000
#define SI32_LOCK_A_PERIPHLOCK0_IDACL_SHIFT  16
// Unlock the IDAC0 and IDAC1 Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_IDACL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_IDACL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_IDACL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_IDACL_SHIFT)
// Lock the IDAC0 and IDAC1 Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_IDACL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_IDACL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_IDACL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_IDACL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_DMACTRLL_MASK  0x00020000
#define SI32_LOCK_A_PERIPHLOCK0_DMACTRLL_SHIFT  17
// Unlock the DMA Controller (DMACTRL0) Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_DMACTRLL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_DMACTRLL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_DMACTRLL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_DMACTRLL_SHIFT)
// Lock the DMA Controller (DMACTRL0) Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_DMACTRLL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_DMACTRLL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_DMACTRLL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_DMACTRLL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_DMAXBARL_MASK  0x00040000
#define SI32_LOCK_A_PERIPHLOCK0_DMAXBARL_SHIFT  18
// Unlock the DMA Crossbar (DMAXBAR0) Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_DMAXBARL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_DMAXBARL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_DMAXBARL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_DMAXBARL_SHIFT)
// Lock the DMA Crossbar (DMAXBAR0) Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_DMAXBARL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_DMAXBARL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_DMAXBARL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_DMAXBARL_SHIFT)

